# üìò –£—Ä–æ–∫: –†–∞–±–æ—Ç–∞ –≤ DWH —á–µ—Ä–µ–∑ Python

## SQLAlchemy

![0_msfsws06ImMSJYop.webp]()

–í —Ä–µ–∞–ª—å–Ω—ã—Ö –∫–æ–º–ø–∞–Ω–∏—è—Ö, –∫–∞–∫ –ø—Ä–∞–≤–∏–ª–æ, Data Scientist –∫–æ–Ω–Ω–µ–∫—Ç–∏—Ç—Å—è –∫ DWH —Å –ø–æ–º–æ—â—å—é **SQLAlchemy** ‚Äî –µ–¥–∏–Ω—ã–π –∫–æ–Ω–Ω–µ–∫—Ç–æ—Ä –∫ –ª—é–±–æ–π SQL-–±–∞–∑–µ:

* PostgreSQL
* MySQL
* Snowflake
* Redshift
* BigQuery (—á–µ—Ä–µ–∑ –¥—Ä–∞–π–≤–µ—Ä)
* SQLite (–≤ –Ω–∞—à–µ–º —Å–ª—É—á–∞–µ –∏—Å–ø–æ–ª—å–∑—É–µ–º –µ–≥–æ)

–∏ –¥—Ä.

SQLAlchemy —Ä–µ—à–∞–µ—Ç –∑–∞–¥–∞—á—É **—É–Ω–∏—Ñ–∏—Ü–∏—Ä–æ–≤–∞–Ω–Ω–æ–≥–æ –¥–æ—Å—Ç—É–ø–∞**:

- –æ–¥–∏–Ω API -> –º–Ω–æ–∂–µ—Å—Ç–≤–æ —Ä–∞–∑–Ω—ã—Ö DWH

- —É–¥–æ–±–Ω–æ –∏—Å–ø–æ–ª—å–∑–æ–≤–∞—Ç—å –≤ Jupyter

- –ø–æ–∑–≤–æ–ª—è–µ—Ç –ø–∏—Å–∞—Ç—å SQL –ø—Ä—è–º–æ –≤ –Ω–æ—É—Ç–±—É–∫–µ

- —É–ø—Ä–∞–≤–ª—è–µ—Ç –ø–æ–¥–∫–ª—é—á–µ–Ω–∏—è–º–∏

- –ø–æ–¥–¥–µ—Ä–∂–∏–≤–∞–µ—Ç –∏ ORM, –∏ –æ–±—ã—á–Ω—ã–µ SQL-–∑–∞–ø—Ä–æ—Å—ã

##  –ü–æ—á–µ–º—É –≤ –∫–∞—á–µ—Å—Ç–≤–µ –ë–î –∏—Å–ø–æ–ª—å–∑–æ–≤–∞–Ω–∞ SQLite?

–ü–æ—Ç–æ–º—É —á—Ç–æ:

* SQLite –ª–µ–≥–∫–æ —Å–æ–∑–¥–∞—Ç—å –ª–æ–∫–∞–ª—å–Ω–æ
* –Ω–µ —Ç—Ä–µ–±—É–µ—Ç —Å–µ—Ä–≤–µ—Ä–∞
* —Ö–æ—Ä–æ—à–æ –ø–æ–¥—Ö–æ–¥–∏—Ç –¥–ª—è —É—á–µ–±–Ω—ã—Ö –∑–∞–¥–∞—á
* –∫—Ä–∞—Å–∏–≤–æ –¥–µ–º–æ–Ω—Å—Ç—Ä–∏—Ä—É–µ—Ç –≤—Å–µ SQL-–ø—Ä–∏—ë–º—ã

–ù–æ –≤–∞–∂–Ω–æ –ø–æ–Ω–∏–º–∞—Ç—å:

> –í —Ä–µ–∞–ª—å–Ω–æ–π —Ä–∞–±–æ—Ç–µ –≤–º–µ—Å—Ç–æ SQLite –±—É–¥–µ—Ç **–Ω–∞—Å—Ç–æ—è—â–µ–µ DWH**, –∞ SQLAlchemy –æ—Å—Ç–∞—ë—Ç—Å—è —Ç–µ–º –∂–µ.

–ü–æ–¥–∫–ª—é—á–µ–Ω–∏–µ –∫ –±–∞–∑–µ

In [1]:
import os
import requests
import pandas as pd
from sqlalchemy import create_engine

# URL –∫ –±–∞–∑–µ
url = "https://raw.githubusercontent.com/totiela/stepik_simulator_ds/main/lessons/lesson_3_2/dwh_base.db"
local_path = "dwh_base.db"

# –°–∫–∞—á–∏–≤–∞–µ–º —Ñ–∞–π–ª, –µ—Å–ª–∏ –µ–≥–æ –Ω–µ—Ç
if not os.path.exists(local_path):
    r = requests.get(url)
    r.raise_for_status()
    with open(local_path, "wb") as f:
        f.write(r.content)

# –ü–æ–¥–∫–ª—é—á–µ–Ω–∏–µ —á–µ—Ä–µ–∑ SQLAlchemy
engine = create_engine(f"sqlite:///{local_path}")

In [3]:
# –ü—Ä–æ–≤–µ—Ä—è–µ–º: –≤—ã–≤–æ–¥–∏–º —Å–ø–∏—Å–æ–∫ —Ç–∞–±–ª–∏—Ü
pd.read_sql('''SELECT name 
            FROM sqlite_master 
            WHERE type='table';''', engine)

                      name
0       src__customers_raw
1        src__accounts_raw
2    src__transactions_raw
3          src__events_raw
4           stg__customers
5            stg__accounts
6        stg__transactions
7              stg__events
8        dwh__dim_customer
9         dwh__dim_account
10  dwh__fact_transactions
11        dwh__fact_events
12   mrt__account_features

## –û–ø–∏—Å–∞–Ω–∏–µ –¥–∞–Ω–Ω—ã—Ö

### üü¶ 1. Source Layer (SRC RAW) ‚Äî *—Å—ã—Ä—ã–µ –¥–∞–Ω–Ω—ã–µ –∫–∞–∫ –∏–∑ CRM/–ª–æ–≥–æ–≤*

–≠—Ç–æ **–æ—Ä–∏–≥–∏–Ω–∞–ª—å–Ω—ã–µ –¥–∞–Ω–Ω—ã–µ**, –∫–æ—Ç–æ—Ä—ã–µ –æ–±—ã—á–Ω–æ –ø—Ä–∏—Ö–æ–¥—è—Ç:

* –∏–∑ CRM,
* –∏–∑ API,
* –∏–∑ –ª–æ–≥–æ–≤ –º–æ–±–∏–ª—å–Ω–æ–≥–æ/–≤–µ–±-–ø—Ä–∏–ª–æ–∂–µ–Ω–∏—è,
* –∏–∑ –∫–∞—Å—Å–æ–≤—ã—Ö —Å–∏—Å—Ç–µ–º,
* –∏–∑ CSV/Excel —Ñ–∞–π–ª–æ–≤.

–í –Ω–∏—Ö –º–æ–≥—É—Ç –±—ã—Ç—å –æ—à–∏–±–∫–∏, –ø—Ä–æ–ø—É—Å–∫–∏, —Å—Ç—Ä–∞–Ω–Ω—ã–µ —Ñ–æ—Ä–º–∞—Ç—ã.

### –¢–∞–±–ª–∏—Ü—ã:

| –¢–∞–±–ª–∏—Ü–∞                     | –ß—Ç–æ —Ö—Ä–∞–Ω–∏—Ç                     | –ü–æ—á–µ–º—É —Å—ã—Ä–æ–µ?                                                        |
| --------------------------- | ------------------------------ | -------------------------------------------------------------------- |
| **`src__customers_raw`**    | –ò–º–µ–Ω–∞, —Ç–µ–ª–µ—Ñ–æ–Ω—ã, –¥–∞—Ç—ã —Ä–æ–∂–¥–µ–Ω–∏—è | –†–∞–∑–Ω—ã–µ —Ñ–æ—Ä–º–∞—Ç—ã –¥–∞—Ç, VIP-—Ñ–ª–∞–≥ –∫–∞–∫ `yes/no/Y/N`, –≤–æ–∑–º–æ–∂–Ω—ã –ø—Ä–æ–ø—É—Å–∫–∏     |
| **`src__accounts_raw`**     | –°—á–µ—Ç–∞ –∫–ª–∏–µ–Ω—Ç–æ–≤                 | –ë–∞–ª–∞–Ω—Å—ã –º–æ–≥—É—Ç –±—ã—Ç—å –æ—Ç—Ä–∏—Ü–∞—Ç–µ–ª—å–Ω—ã–µ, —Å—Ç–∞—Ç—É—Å—ã ‚Äî –Ω–µ—Å—Ç–∞–Ω–¥–∞—Ä—Ç–Ω—ã–µ            |
| **`src__transactions_raw`** | –¢—Ä–∞–Ω–∑–∞–∫—Ü–∏–∏                     | –°—É–º–º—ã –º–æ–≥—É—Ç –±—ã—Ç—å –æ—Ç—Ä–∏—Ü–∞—Ç–µ–ª—å–Ω—ã–µ/–æ—à–∏–±–æ—á–Ω—ã–µ, –Ω–µ—Ç –Ω–æ—Ä–º–∞–ª—å–Ω–æ–≥–æ ID –∫–ª–∏–µ–Ω—Ç–∞ |
| **`src__events_raw`**       | –õ–æ–≥–∏ –¥–µ–π—Å—Ç–≤–∏–π                  | –ú–Ω–æ–≥–æ —à—É–º–∞, –ø–æ–≤—Ç–æ—Ä–æ–≤, –Ω–µ—Ç –Ω–æ—Ä–º–∞–ª—å–Ω–æ–π —Ç–∏–ø–∏–∑–∞—Ü–∏–∏                       |

In [6]:
pd.read_sql('''SELECT * 
            FROM src__customers_raw 
            LIMIT 10;''', engine)

,CustomerID,FullName,BirthDate,Phone,is_vip_flag,SignUpChannel
0,1,–ê–ª–µ–∫—Å–µ–π –°–∏–¥–æ—Ä–æ–≤,None,None,1,kiosk
1,2,–ê–ª–µ–∫—Å–µ–π –ö—É–∑–Ω–µ—Ü–æ–≤,None,+74537325166,0,web
2,3,–ú–ê–†–ò–Ø –ò–≤–∞–Ω–æ–≤,2000-11-8,+74537325166,1,??
3,4,–°–µ—Ä–≥–µ–π –ü–µ—Ç—Ä–æ–≤,2000-11-8,87118618511,no,??
4,5,–ê–ª–µ–∫—Å–µ–π –ö—É–∑–Ω–µ—Ü–æ–≤,2000-11-8,+74537325166,None,kiosk
5,6,–ú–∞—Ä–∏—è –ü–µ—Ç—Ä–æ–≤,2000-11-8,+74537325166,Y,branch
6,7,–ò–≤–∞–Ω –°–∏–¥–æ—Ä–æ–≤,2000-11-8,87118618511,0,??
7,8,–ú–ê–†–ò–Ø –ò–≤–∞–Ω–æ–≤,2000-11-8,+74537325166,no,??
8,9,–ê–Ω–Ω–∞ –ò–≤–∞–Ω–æ–≤,2000-11-8,+74537325166,yes,MOBILE
9,10,–ú–ê–†–ò–Ø –ö—É–∑–Ω–µ—Ü–æ–≤,2000-11-8,+74537325166,1,MOBILE

### üüß 2. Staging Layer (STG) ‚Äî *–ø—Ä–∏–≤–µ–¥—ë–Ω–Ω—ã–µ –≤ –ø–æ—Ä—è–¥–æ–∫ –¥–∞–Ω–Ω—ã–µ*

STG ‚Äî —ç—Ç–æ —Å–ª–æ–π, –≥–¥–µ —Å—ã—Ä—ã–µ –¥–∞–Ω–Ω—ã–µ –ø—Ä–æ—Ö–æ–¥—è—Ç –ø–µ—Ä–≤–∏—á–Ω—É—é –æ—á–∏—Å—Ç–∫—É –∏ –Ω–æ—Ä–º–∞–ª–∏–∑–∞—Ü–∏—é, —á—Ç–æ–±—ã –∏—Ö –º–æ–∂–Ω–æ –±—ã–ª–æ –±–µ–∑–æ–ø–∞—Å–Ω–æ –∏—Å–ø–æ–ª—å–∑–æ–≤–∞—Ç—å –¥–∞–ª—å—à–µ.

–≠—Ç–æ –ù–ï –∞–Ω–∞–ª–∏—Ç–∏—á–µ—Å–∫–∞—è –º–æ–¥–µ–ª—å, –Ω–æ —ç—Ç–æ —É–∂–µ –¥–∞–Ω–Ω—ã–µ, —Å –∫–æ—Ç–æ—Ä—ã–º–∏:

* –Ω–µ ¬´–ª–æ–º–∞–µ—Ç—Å—è¬ª –ø—Ä–µ–æ–±—Ä–∞–∑–æ–≤–∞–Ω–∏–µ —Ç–∏–ø–æ–≤,
* –∫–æ—Ä—Ä–µ–∫—Ç–Ω–æ —Ä–∞–±–æ—Ç–∞—é—Ç JOIN‚Äô—ã,
* –º–æ–∂–Ω–æ —Å—á–∏—Ç–∞—Ç—å –∞–≥—Ä–µ–≥–∞—Ç—ã,
* –º–æ–∂–Ω–æ —Å—Ç—Ä–æ–∏—Ç—å –≤–∏—Ç—Ä–∏–Ω—ã.

–ü–æ —Å—É—Ç–∏, STG ‚Äî —ç—Ç–æ **–±—É—Ñ–µ—Ä –º–µ–∂–¥—É —Ö–∞–æ—Å–æ–º RAW –∏ —Å—Ç—Ä—É–∫—Ç—É—Ä–æ–π DWH**.

### –¢–∞–±–ª–∏—Ü—ã:

| –¢–∞–±–ª–∏—Ü–∞                 | –ß—Ç–æ –∏–∑–º–µ–Ω–∏–ª–∏                                                                 |
| ----------------------- | ---------------------------------------------------------------------------- |
| **`stg__customers`**    | –°—Ç–∞–Ω–¥–∞—Ä—Ç–∏–∑–∏—Ä–æ–≤–∞–ª–∏ –∏–º–µ–Ω–∞ –∫–æ–ª–æ–Ω–æ–∫, –ø—Ä–µ–æ–±—Ä–∞–∑–æ–≤–∞–ª–∏ `vip_flag`, –¥–∞—Ç—ã ‚Äî –≤ datetime |
| **`stg__accounts`**     | –ü—Ä–∏–≤–µ–ª–∏ —Ç–∏–ø—ã, —Å—Ç–∞–Ω–¥–∞—Ä—Ç–∏–∑–∏—Ä–æ–≤–∞–ª–∏ —Ç–∏–ø —Å—á–µ—Ç–∞                                    |
| **`stg__transactions`** | –ß–∏—Å—Ç—ã–π timestamp, –ø—Ä–∞–≤–∏–ª—å–Ω—ã–µ –Ω–∞–∑–≤–∞–Ω–∏—è –∫–æ–ª–æ–Ω–æ–∫                                |
| **`stg__events`**       | –ü—Ä–∏–≤–µ–ª–∏ —Ñ–æ—Ä–º–∞—Ç –≤—Ä–µ–º–µ–Ω–∏ –∏ —Ç–∏–ø—ã —Å–æ–±—ã—Ç–∏–π                                        |

In [7]:
pd.read_sql('''SELECT * 
            FROM stg__customers 
            LIMIT 10;''', engine)

,customer_id,full_name,birth_date_raw,phone_raw,vip_flag_raw,signup_channel_raw,birth_date,phone,vip_flag,signup_channel
0,1,–ê–ª–µ–∫—Å–µ–π –°–∏–¥–æ—Ä–æ–≤,None,None,1,kiosk,None,None,1.0,kiosk
1,2,–ê–ª–µ–∫—Å–µ–π –ö—É–∑–Ω–µ—Ü–æ–≤,None,+74537325166,0,web,None,+74537325166,0.0,web
2,3,–ú–∞—Ä–∏—è –ò–≤–∞–Ω–æ–≤,2000-11-8,+74537325166,1,??,2000-11-08 00:00:00,+74537325166,1.0,unknown
3,4,–°–µ—Ä–≥–µ–π –ü–µ—Ç—Ä–æ–≤,2000-11-8,87118618511,no,??,2000-11-08 00:00:00,+77118618511,0.0,unknown
4,5,–ê–ª–µ–∫—Å–µ–π –ö—É–∑–Ω–µ—Ü–æ–≤,2000-11-8,+74537325166,None,kiosk,2000-11-08 00:00:00,+74537325166,NaN,kiosk
5,6,–ú–∞—Ä–∏—è –ü–µ—Ç—Ä–æ–≤,2000-11-8,+74537325166,Y,branch,2000-11-08 00:00:00,+74537325166,1.0,branch
6,7,–ò–≤–∞–Ω –°–∏–¥–æ—Ä–æ–≤,2000-11-8,87118618511,0,??,2000-11-08 00:00:00,+77118618511,0.0,unknown
7,8,–ú–∞—Ä–∏—è –ò–≤–∞–Ω–æ–≤,2000-11-8,+74537325166,no,??,2000-11-08 00:00:00,+74537325166,0.0,unknown
8,9,–ê–Ω–Ω–∞ –ò–≤–∞–Ω–æ–≤,2000-11-8,+74537325166,yes,MOBILE,2000-11-08 00:00:00,+74537325166,1.0,mobile
9,10,–ú–∞—Ä–∏—è –ö—É–∑–Ω–µ—Ü–æ–≤,2000-11-8,+74537325166,1,MOBILE,2000-11-08 00:00:00,+74537325166,1.0,mobile

### üü© 3. DWH Layer (—è–¥—Ä–æ —Ö—Ä–∞–Ω–∏–ª–∏—â–∞)

–≠—Ç–æ **—Å–µ—Ä–¥—Ü–µ —Ö—Ä–∞–Ω–∏–ª–∏—â–∞**, –≥–¥–µ –¥–∞–Ω–Ω—ã–µ –ø—Ä–µ–≤—Ä–∞—â–∞—é—Ç—Å—è –≤:


–°–ø—Ä–∞–≤–æ—á–Ω–∏–∫–∏ –∏ ¬´–ø–æ–Ω—è—Ç–∏—è¬ª

| –¢–∞–±–ª–∏—Ü–∞                 | –û–ø–∏—Å–∞–Ω–∏–µ                                                               |
| ----------------------- | ---------------------------------------------------------------------- |
| **`dwh__dim_customer`** | –ò–∑–º–µ—Ä–µ–Ω–∏–µ –∫–ª–∏–µ–Ω—Ç–∞: –§–ò–û, —Ç–µ–ª–µ—Ñ–æ–Ω, –¥–∞—Ç–∞ —Ä–æ–∂–¥–µ–Ω–∏—è, –µ–¥–∏–Ω–æ–æ–±—Ä–∞–∑–Ω—ã–π VIP-—Ñ–ª–∞–≥ |
| **`dwh__dim_account`**  | –ò–∑–º–µ—Ä–µ–Ω–∏–µ —Å—á—ë—Ç–∞: —Ç–∏–ø, –¥–∞—Ç–∞ –æ—Ç–∫—Ä—ã—Ç–∏—è, –∫–ª–∏–µ–Ω—Ç                            |


–°–æ–±—ã—Ç–∏—è, –∫–æ—Ç–æ—Ä—ã–µ –º–æ–∂–Ω–æ —Å—á–∏—Ç–∞—Ç—å, —Å—É–º–º–∏—Ä–æ–≤–∞—Ç—å.

| –¢–∞–±–ª–∏—Ü–∞                      | –û–ø–∏—Å–∞–Ω–∏–µ                             |
| ---------------------------- | ------------------------------------ |
| **`dwh__fact_transactions`** | –í—Å–µ —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–∏, –ø—Ä–∏–≤—è–∑–∞–Ω–Ω—ã–µ –∫ —Å—á–µ—Ç–∞–º |
| **`dwh__fact_events`**       | –í—Å–µ –¥–µ–π—Å—Ç–≤–∏—è –∫–ª–∏–µ–Ω—Ç–æ–≤ –≤ –ø—Ä–∏–ª–æ–∂–µ–Ω–∏–∏   |

In [9]:
pd.read_sql('''SELECT * 
            FROM dwh__fact_transactions 
            LIMIT 10;''', engine)

,txn_id,account_id_raw,amount_raw,txn_time_raw,category,account_id,amount,txn_time,account_sk
0,1,1270,-4667.351889058535,2022-06-02 00:00:00,transfer,1270,-4667.351889,2022-02-06 00:00:00,1270
1,2,1104,-3658.987033452697,2020-06-17 00:00:00,atm,1104,-3658.987033,None,1104
2,3,885,9018.893674267936,2022-12-01 00:00:00,transfer,885,9018.893674,2022-01-12 00:00:00,885
3,4,487,12313.175747350408,18-12-2022 00:00:00,transfer,487,12313.175747,None,487
4,5,43,-12716.22190934183,23-08-2021 00:00:00,atm,43,-12716.221909,None,43
5,6,1034,-9446.912548095892,08-06-2021 00:00:00,purchase,1034,-9446.912548,None,1034
6,7,194,10603.223391341726,2021-01-29 00:00:00,atm,194,10603.223391,None,194
7,8,523,-11689.612044206395,15-05-2022 00:00:00,income,523,-11689.612044,None,523
8,9,1419,14135.375501671217,04-06-2022 00:00:00,atm,1419,14135.375502,None,1419
9,10,159,-18069.838749896706,2023-04-04 00:00:00,income,159,-18069.838750,2023-04-04 00:00:00,159

In [8]:
pd.read_sql('''SELECT 
            customer_id, 
            COUNT(*) 
            FROM dwh__fact_events 
            GROUP BY 1 
            LIMIT 10;''', engine)

   customer_id  COUNT(*)
0            1         7
1            2        13
2            3        11
3            4         6
4            5         4
5            6        10
6            7        11
7            8        11
8            9        10
9           10         7

### üü® 4. Consumption Layer (MARTS)* ‚Äî –≤–∏—Ç—Ä–∏–Ω—ã –∫–æ—Ç–æ—Ä—ã–µ —É–∂–µ —Å–æ–∑–¥–∞–ª Data Scientist

–≠—Ç–æ —Å–ª–æ–π, –Ω–∞ –∫–æ—Ç–æ—Ä–æ–º –ø–æ—è–≤–ª—è—é—Ç—Å—è **–≥–æ—Ç–æ–≤—ã–µ —Ñ–∏—á–∏**:

* –∞–≥—Ä–µ–≥–∞—Ç—ã,
* —Å—É–º–º—ã,
* –æ–∫–Ω–∞,
* –ø–æ–≤–µ–¥–µ–Ω—á–µ—Å–∫–∏–µ –ø—Ä–∏–∑–Ω–∞–∫–∏.

| –¢–∞–±–ª–∏—Ü–∞                     | –û–ø–∏—Å–∞–Ω–∏–µ                                                           |
| --------------------------- | ------------------------------------------------------------------ |
| **`mrt__account_features`** | –°—É–º–º—ã, —Å—Ä–µ–¥–Ω–∏–µ, –º–∏–Ω/–º–∞–∫—Å —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–π –ø–æ –∫–∞–∂–¥–æ–º—É —Å—á—ë—Ç—É ‚Äî –≥–æ—Ç–æ–≤–æ –∫ ML |

In [10]:
pd.read_sql('''SELECT * 
            FROM mrt__account_features 
            LIMIT 10;''', engine)

,account_id,amount_sum,amount_mean,amount_max,amount_min,amount_count,txn_count
0,1,-34960.110585,-3496.011058,17681.940889,-14193.210897,10,10
1,2,2964.060702,296.406070,17896.574437,-19250.423854,10,10
2,3,41305.750727,5163.218841,18803.352062,-13766.010316,8,8
3,4,-10995.389167,-1221.709907,14240.580558,-13679.080492,9,9
4,5,28529.602838,4075.657548,19345.191921,-1836.973405,7,7
5,6,-25489.810152,-4248.301692,8124.919729,-18737.709039,6,6
6,7,-25231.951154,-5046.390231,16866.253276,-17903.736200,5,5
7,8,-49569.694603,-16523.231534,-10068.203112,-19985.907154,3,3
8,9,37360.582589,4151.175843,18392.459047,-10499.725634,9,9
9,10,-27197.778870,-2719.777887,19333.276455,-19559.587470,10,10

### –†–∞–±–æ—Ç–∞ —Å DWH

In [11]:
# –°–∫–æ–ª—å–∫–æ —Å–æ–±—ã—Ç–∏–π –Ω–∞ –∫–∞–∂–¥–æ–≥–æ –∫–ª–∏–µ–Ω—Ç–∞?
pd.read_sql("""
SELECT customer_id, COUNT(*) AS events
FROM dwh__fact_events
GROUP BY 1
ORDER BY events DESC
LIMIT 5;
""", engine)

   customer_id  events
0          471      20
1          931      19
2          526      18
3          524      18
4          409      18

In [12]:
# –í—ã—è–≤–ª–µ–Ω–∏–µ —Å—á–µ—Ç–æ–≤ —Å –Ω–æ—á–Ω–æ–π –∞–∫—Ç–∏–≤–Ω–æ—Å—Ç—å—é - –º–æ–∂–µ—Ç –±—ã—Ç—å –ø–æ–ª–µ–∑–Ω–æ –¥–ª—è –º–æ–¥–µ–ª–∏ –∞–Ω—Ç–∏—Ñ—Ä–æ–¥–∞
pd.read_sql("""
SELECT
    t.account_id,
    COUNT(*) AS night_txn
FROM dwh__fact_transactions t
WHERE CAST(STRFTIME('%H', t.txn_time) AS INTEGER) BETWEEN 0 AND 5
GROUP BY t.account_id;

""", engine)

     account_id  night_txn
0             1          2
1             2          4
2             3          2
3             4          4
4             5          1
..          ...        ...
788        1486          1
789        1487          1
790        1489          1
791        1490          2
792        1492          1

[793 rows x 2 columns]

In [13]:
# –°—Ä–µ–¥–Ω–∏–π –±–∞–ª–∞–Ω—Å –ø–æ —Ç–∏–ø–∞–º —Å—á–µ—Ç–æ–≤
pd.read_sql("""
SELECT acc_type, AVG(balance) AS avg_balance
FROM dwh__dim_account
GROUP BY acc_type;
""", engine)

  acc_type    avg_balance
0   credit  144895.408853
1    debit  144978.041239
2  unknown  142036.518982

In [14]:
# –≥–æ—Ç–æ–≤—ã–π –Ω–∞–±–æ—Ä –ø—Ä–∏–∑–Ω–∞–∫–æ–≤: –±–∞–ª–∞–Ω—Å, —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–∏, –∞–∫—Ç–∏–≤–Ω–æ—Å—Ç—å, –ø–æ–≤–µ–¥–µ–Ω–∏–µ
df_features = pd.read_sql("""
SELECT
    a.customer_id,
    SUM(f.amount_sum) AS total_spent,
    SUM(f.txn_count) AS total_txn,
    AVG(a.balance) AS avg_balance,
    c.vip_flag,
    c.signup_channel,
    COUNT(e.event_id) AS event_count
FROM dwh__dim_customer c
LEFT JOIN dwh__dim_account a ON c.customer_id = a.customer_id
LEFT JOIN mrt__account_features f ON a.account_id = f.account_id
LEFT JOIN dwh__fact_events e ON c.customer_id = e.customer_id
GROUP BY c.customer_id;
""", engine)

df_features.head()

,customer_id,total_spent,total_txn,avg_balance,vip_flag,signup_channel,event_count
0,1.0,115165.674838,56.0,70712.470308,1.0,kiosk,14
1,2.0,5610.377747,13.0,17065.533361,0.0,web,13
2,NaN,NaN,NaN,NaN,1.0,unknown,11
3,4.0,-61622.351540,66.0,71777.529971,0.0,unknown,24
4,5.0,40384.790570,16.0,173862.933718,NaN,kiosk,4

** –≤ –∑–∞–≤–∏—Å–∏–º–æ—Å—Ç–∏ –æ—Ç —Ç–æ–≥–æ —á—Ç–æ –º—ã —Ö–æ—Ç–∏–º –ø—Ä–µ–¥—Å–∫–∞–∑—ã–≤–∞—Ç—å, –∑–¥–µ—Å—å –º–æ–∂–µ—Ç –±—ã—Ç—å —É—Ç–µ—á–∫–∞ –¥–∞–Ω–Ω—ã—Ö, –æ–± —ç—Ç–æ–º –ø–æ–≥–æ–≤–æ—Ä–∏–º –ø–æ–∑–∂–µ!

### –°–∞–º–æ—Å—Ç–æ—è—Ç–µ–ª—å–Ω–æ–µ –∑–∞–¥–∞–Ω–∏–µ

1. –ü–æ—Å—á–∏—Ç–∞—Ç—å –∫–ª–∏–µ–Ω—Ç–æ–≤, —É –∫–æ—Ç–æ—Ä—ã—Ö –±–æ–ª—å—à–µ 3—Ö –∞–∫—Ç–∏–≤–Ω—ã—Ö —Å—á–µ—Ç–æ–≤

P.S. –ê–∫—Ç–∏–≤–Ω—ã–º —è–≤–ª—è–µ—Ç—Å—è –ª—é–±–æ–π —Å—á–µ—Ç –≤ `dwh__dim_account`

In [21]:
pd.read_sql("""
SELECT COUNT(*) AS customers_with_many_accounts
FROM (
    SELECT customer_id
    FROM dwh__dim_account
    GROUP BY customer_id
    HAVING COUNT(*) > 3
);
""", engine)

   customers_with_many_accounts
0                            71

–í–æ–ø—Ä–æ—Å 1: –°–∫–æ–ª—å–∫–æ –∫–ª–∏–µ–Ω—Ç–æ–≤ –∏–º–µ—é—Ç –±–æ–ª–µ–µ 3 –∞–∫—Ç–∏–≤–Ω—ã—Ö —Å—á–µ—Ç–æ–≤?

 -> –æ—Ç–≤–µ—Ç –≤–Ω–µ—Å—Ç–∏ –≤ Stepik

2. –ü–æ—Å—á–∏—Ç–∞—Ç—å –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–π –ø–æ —Ç–∏–ø–∞–º (`debit` / `credit`)**
–¢—Ä–∞–Ω–∑–∞–∫—Ü–∏–∏ –ª–µ–∂–∞—Ç –≤ `dwh__fact_transactions`, –∞ —Ç–∏–ø —Å—á—ë—Ç–∞ ‚Äî –≤ `dwh__dim_account`.

In [ ]:
pd.read_sql("""
SELECT a.acc_type,
COUNT(*) AS acc_type_cnt
FROM dwh__fact_transactions t
INNER JOIN dwh__dim_account a
ON t.account_id_raw = a.account_id
WHERE a.acc_type = 'debit'
GROUP BY a.acc_type;
""", engine)

  acc_type  acc_type_cnt
0    debit          2002

–í–æ–ø—Ä–æ—Å 2: –∫–∞–∫–æ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–π —É —Å—á–µ—Ç–æ–≤ —Ç–∏–ø–∞ `debit`?

 -> –æ—Ç–≤–µ—Ç –≤–Ω–µ—Å—Ç–∏ –≤ Stepik

3. –ü–æ—Å–∏—á—Ç–∞—Ç—å —Å–∫–æ–ª—å–∫–æ –∫–ª–∏–µ–Ω—Ç–æ–≤ (*customer_id*) —Å–æ–≤–µ—Ä—à–∏–ª–∏ –±–æ–ª—å—à–µ 15 —Å–æ–±—ã—Ç–∏–π (`dwh__fact_events`) –∏ –±–æ–ª–µ–µ 5 —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–π (`dwh__fact_transactions`)?

In [56]:
print('dwh__dim_customer')
display(pd.read_sql("""
SELECT * FROM dwh__dim_customer
LIMIT 5;
""", engine))

print('dwh__fact_events')
display(pd.read_sql("""
SELECT * FROM dwh__fact_events
LIMIT 5;
""", engine))

print('dwh__dim_account')
display(pd.read_sql("""
SELECT * FROM dwh__dim_account
LIMIT 5;
""", engine))

print('dwh__fact_transactions')
pd.read_sql("""
SELECT * FROM dwh__fact_transactions
LIMIT 5;
""", engine)

dwh__dim_customer

,customer_sk,customer_id,full_name,birth_date,phone,vip_flag,signup_channel,effective_from,effective_to
0,1,1,–ê–ª–µ–∫—Å–µ–π –°–∏–¥–æ—Ä–æ–≤,None,None,1.0,kiosk,2025-12-07 11:54:36.351152,None
1,2,2,–ê–ª–µ–∫—Å–µ–π –ö—É–∑–Ω–µ—Ü–æ–≤,None,+74537325166,0.0,web,2025-12-07 11:54:36.351152,None
2,3,3,–ú–∞—Ä–∏—è –ò–≤–∞–Ω–æ–≤,2000-11-08 00:00:00,+74537325166,1.0,unknown,2025-12-07 11:54:36.351152,None
3,4,4,–°–µ—Ä–≥–µ–π –ü–µ—Ç—Ä–æ–≤,2000-11-08 00:00:00,+77118618511,0.0,unknown,2025-12-07 11:54:36.351152,None
4,5,5,–ê–ª–µ–∫—Å–µ–π –ö—É–∑–Ω–µ—Ü–æ–≤,2000-11-08 00:00:00,+74537325166,NaN,kiosk,2025-12-07 11:54:36.351152,None

dwh__fact_events

,event_id,customer_id,event_type_raw,event_time_raw,device,event_type,event_time,customer_sk
0,1,891,login,2022-01-11 00:00:00,unknown,login,2022-11-01 00:00:00,891
1,2,946,login,2022-01-11 00:00:00,android,login,2022-11-01 00:00:00,946
2,3,199,screen_view,None,unknown,screen_view,None,199
3,4,397,None,29/09/2023 00:00,android,None,None,397
4,5,407,None,None,android,None,None,407

dwh__dim_account

,account_sk,account_id,customer_id,opened_dt,acc_type,balance,effective_from,effective_to
0,1,1,266,2018-03-09 00:00:00,debit,98852.157799,2025-12-07 11:54:36.420976,None
1,2,2,676,None,unknown,214779.427381,2025-12-07 11:54:36.420976,None
2,3,3,977,None,credit,20231.979471,2025-12-07 11:54:36.420976,None
3,4,4,855,None,credit,8303.262937,2025-12-07 11:54:36.420976,None
4,5,5,775,None,debit,181733.064632,2025-12-07 11:54:36.420976,None

dwh__fact_transactions

,txn_id,account_id_raw,amount_raw,txn_time_raw,category,account_id,amount,txn_time,account_sk
0,1,1270,-4667.351889058535,2022-06-02 00:00:00,transfer,1270,-4667.351889,2022-02-06 00:00:00,1270
1,2,1104,-3658.987033452697,2020-06-17 00:00:00,atm,1104,-3658.987033,None,1104
2,3,885,9018.893674267936,2022-12-01 00:00:00,transfer,885,9018.893674,2022-01-12 00:00:00,885
3,4,487,12313.175747350408,18-12-2022 00:00:00,transfer,487,12313.175747,None,487
4,5,43,-12716.22190934183,23-08-2021 00:00:00,atm,43,-12716.221909,None,43

In [54]:
pd.read_sql("""
SELECT e.customer_id,
COUNT(e.event_id) AS event_cnt,
COUNT(t.txn_id) AS txn_cnt
FROM dwh__fact_transactions t
JOIN dwh__fact_events e
ON t.account_id = e.customer_id
GROUP BY e.customer_id
LIMIT 5;
""", engine)

   customer_id  event_cnt  txn_cnt
0            1         70       70
1            2        130      130
2            3         88       88
3            4         54       54
4            5         28       28

–í–æ–ø—Ä–æ—Å 3: –°–∫–æ–ª—å–∫–æ –∫–ª–∏–µ–Ω—Ç–æ–≤ —Å–æ–≤–µ—Ä—à–∏–ª–∏ –±–æ–ª—å—à–µ 15 —Å–æ–±—ã—Ç–∏–π (dwh__fact_events) –∏ –±–æ–ª–µ–µ 5 —Ç—Ä–∞–Ω–∑–∞–∫—Ü–∏–π (dwh__fact_transactions)?

 -> –æ—Ç–≤–µ—Ç –≤–Ω–µ—Å—Ç–∏ –≤ Stepik